# PointIterator Properties

---
The PointIterator type exposes the following members.
| Name| Description
---|---|---
| Current|
| CurrentObject|
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace